#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_instance.vm1 will be destroyed
  - resource "google_compute_instance" "vm1" {
      - can_ip_forward          = false -> null
      - cpu_platform            = "Intel Haswell" -> null
      - deletion_protection     = false -> null
      - enable_display          = false -> null
      - guest_accelerator       = [] -> null
      - id                      = "projects/blizzard-253119/zones/us-central1-a/instances/test-machine" -> null
      - instance_id             = "8602789306768161184" -> null
      - label_fingerprint       = "42WmSpB8rSM=" -> null
      - labels                  = {} -> null
      - machine_type            = "n1-standard-1" -> null
      - metadata                = {} -> null
      - metadata_fingerprint    = "kSqMB0rB_sc=" -> null
      - metadata_startup_script = "scripts/install_nginx.sh" -> null
      - name                    = "test-machine" -> null
      - project                 = "blizzard-253119" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/blizzard-253119/zones/us-central1-a/instances/test-machine" -> null
      - tags                    = [
          - "http-server",
        ] -> null
      - tags_fingerprint        = "FYLDgkTKlA4=" -> null
      - zone                    = "us-central1-a" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/blizzard-253119/zones/us-central1-a/disks/test-machine" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/centos-cloud/global/images/centos-7-v20191121" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/blizzard-253119/global/networks/default" -> null
          - network_ip         = "10.128.0.38" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/blizzard-253119/regions/us-central1/subnetworks/default" -> null
          - subnetwork_project = "blizzard-253119" -> null

          - access_config {
              - nat_ip       = "35.223.94.5" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
        }
    }

  # google_storage_bucket_object.index will be created
  + resource "google_storage_bucket_object" "index" {
      + bucket         = "www.sourpatch.net"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + md5hash        = (known after apply)
      + name           = "index.html"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "pages/index.html"
      + storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
